app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Dan Wenald"], ["content", "sadasd"], ["created_at", "2018-07-06 06:36:48.554507"], ["updated_at", "2018-07-06 06:36:48.554507"]]
---
	def create
		#render plain: params[:post].inspect
		@post = Post.new(post_params)

		if(@post.save)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Calub"], ["updated_at", "2018-07-06 06:55:30.818984"], ["id", 29]]
---
	def update
		@post = Post.find(params[:id])

		if(@post.update(post_params))